zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_FLEXIO.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_FLEXIO.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_FLEXIO
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_FLEXIO_H_)  /* Check if memory map has not been already included */
#define S32K566_FLEXIO_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- FLEXIO Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXIO_Peripheral_Access_Layer FLEXIO Peripheral Access Layer
 * @{
 */

/** FLEXIO - Size of Registers Arrays */
#define FLEXIO_SHIFTCTL_COUNT                     16u
#define FLEXIO_SHIFTCFG_COUNT                     16u
#define FLEXIO_SHIFTBUF_COUNT                     16u
#define FLEXIO_SHIFTBUFBIS_COUNT                  16u
#define FLEXIO_SHIFTBUFBYS_COUNT                  16u
#define FLEXIO_SHIFTBUFBBS_COUNT                  16u
#define FLEXIO_TIMCTL_COUNT                       16u
#define FLEXIO_TIMCFG_COUNT                       16u
#define FLEXIO_TIMCMP_COUNT                       16u
#define FLEXIO_SHIFTBUFNBS_COUNT                  16u
#define FLEXIO_SHIFTBUFHWS_COUNT                  16u
#define FLEXIO_SHIFTBUFNIS_COUNT                  16u
#define FLEXIO_SHIFTBUFOES_COUNT                  16u
#define FLEXIO_SHIFTBUFEOS_COUNT                  16u
#define FLEXIO_SHIFTBUFHBS_COUNT                  16u

/** FLEXIO - Register Layout Typedef */
typedef struct FLEXIO_Struct {
  __I  uint32_t VERID;                             /**< Version ID, offset: 0x0 */
  __I  uint32_t PARAM;                             /**< Parameter, offset: 0x4 */
  __IO uint32_t CTRL;                              /**< FLEXIO Control, offset: 0x8 */
  __I  uint32_t PIN;                               /**< Pin State, offset: 0xC */
  __IO uint32_t SHIFTSTAT;                         /**< Shifter Status, offset: 0x10 */
  __IO uint32_t SHIFTERR;                          /**< Shifter Error, offset: 0x14 */
  __IO uint32_t TIMSTAT;                           /**< Timer Status Flag, offset: 0x18 */
  uint8_t RESERVED_0[4];
  __IO uint32_t SHIFTSIEN;                         /**< Shifter Status Interrupt Enable, offset: 0x20 */
  __IO uint32_t SHIFTEIEN;                         /**< Shifter Error Interrupt Enable, offset: 0x24 */
  __IO uint32_t TIMIEN;                            /**< Timer Interrupt Enable, offset: 0x28 */
  uint8_t RESERVED_1[4];
  __IO uint32_t SHIFTSDEN;                         /**< Shifter Status DMA Enable, offset: 0x30 */
  uint8_t RESERVED_2[4];
  __IO uint32_t TIMERSDEN;                         /**< Timer Status DMA Enable, offset: 0x38 */
  uint8_t RESERVED_3[4];
  __IO uint32_t SHIFTSTATE;                        /**< Shifter State, offset: 0x40 */
  uint8_t RESERVED_4[4];
  __IO uint32_t TRGSTAT;                           /**< Trigger Status, offset: 0x48 */
  __IO uint32_t TRIGIEN;                           /**< External Trigger Interrupt Enable, offset: 0x4C */
  __IO uint32_t PINSTAT;                           /**< Pin Status, offset: 0x50 */
  __IO uint32_t PINIEN;                            /**< Pin Interrupt Enable, offset: 0x54 */
  __IO uint32_t PINREN;                            /**< Pin Rising Edge Enable, offset: 0x58 */
  __IO uint32_t PINFEN;                            /**< Pin Falling Edge Enable, offset: 0x5C */
  __IO uint32_t PINOUTD;                           /**< Pin Output Data, offset: 0x60 */
  __IO uint32_t PINOUTE;                           /**< Pin Output Enable, offset: 0x64 */
  __IO uint32_t PINOUTDIS;                         /**< Pin Output Disable, offset: 0x68 */
  __IO uint32_t PINOUTCLR;                         /**< Pin Output Clear, offset: 0x6C */
  __IO uint32_t PINOUTSET;                         /**< Pin Output Set, offset: 0x70 */
  __IO uint32_t PINOUTTOG;                         /**< Pin Output Toggle, offset: 0x74 */
  uint8_t RESERVED_5[8];
  __IO uint32_t SHIFTCTL[FLEXIO_SHIFTCTL_COUNT];   /**< Shifter Control, array offset: 0x80, array step: 0x4 */
  uint8_t RESERVED_6[64];
  __IO uint32_t SHIFTCFG[FLEXIO_SHIFTCFG_COUNT];   /**< Shifter Configuration, array offset: 0x100, array step: 0x4 */
  uint8_t RESERVED_7[192];
  __IO uint32_t SHIFTBUF[FLEXIO_SHIFTBUF_COUNT];   /**< Shifter Buffer, array offset: 0x200, array step: 0x4 */
  uint8_t RESERVED_8[64];
  __IO uint32_t SHIFTBUFBIS[FLEXIO_SHIFTBUFBIS_COUNT]; /**< Shifter Buffer Bit Swapped, array offset: 0x280, array step: 0x4 */
  uint8_t RESERVED_9[64];
  __IO uint32_t SHIFTBUFBYS[FLEXIO_SHIFTBUFBYS_COUNT]; /**< Shifter Buffer Byte Swapped, array offset: 0x300, array step: 0x4 */
  uint8_t RESERVED_10[64];
  __IO uint32_t SHIFTBUFBBS[FLEXIO_SHIFTBUFBBS_COUNT]; /**< Shifter Buffer Bit Byte Swapped, array offset: 0x380, array step: 0x4 */
  uint8_t RESERVED_11[64];
  __IO uint32_t TIMCTL[FLEXIO_TIMCTL_COUNT];       /**< Timer Control, array offset: 0x400, array step: 0x4 */
  uint8_t RESERVED_12[64];
  __IO uint32_t TIMCFG[FLEXIO_TIMCFG_COUNT];       /**< Timer Configuration, array offset: 0x480, array step: 0x4 */
  uint8_t RESERVED_13[64];
  __IO uint32_t TIMCMP[FLEXIO_TIMCMP_COUNT];       /**< Timer Compare, array offset: 0x500, array step: 0x4 */
  uint8_t RESERVED_14[320];
  __IO uint32_t SHIFTBUFNBS[FLEXIO_SHIFTBUFNBS_COUNT]; /**< Shifter Buffer Nibble Byte Swapped, array offset: 0x680, array step: 0x4 */
  uint8_t RESERVED_15[64];
  __IO uint32_t SHIFTBUFHWS[FLEXIO_SHIFTBUFHWS_COUNT]; /**< Shifter Buffer Halfword Swapped, array offset: 0x700, array step: 0x4 */
  uint8_t RESERVED_16[64];
  __IO uint32_t SHIFTBUFNIS[FLEXIO_SHIFTBUFNIS_COUNT]; /**< Shifter Buffer Nibble Swapped, array offset: 0x780, array step: 0x4 */
  uint8_t RESERVED_17[64];
  __IO uint32_t SHIFTBUFOES[FLEXIO_SHIFTBUFOES_COUNT]; /**< Shifter Buffer Odd Even Swapped, array offset: 0x800, array step: 0x4 */
  uint8_t RESERVED_18[64];
  __IO uint32_t SHIFTBUFEOS[FLEXIO_SHIFTBUFEOS_COUNT]; /**< Shifter Buffer Even Odd Swapped, array offset: 0x880, array step: 0x4 */
  uint8_t RESERVED_19[64];
  __IO uint32_t SHIFTBUFHBS[FLEXIO_SHIFTBUFHBS_COUNT]; /**< Shifter Buffer Halfword Byte Swapped, array offset: 0x900, array step: 0x4 */
} FLEXIO_Type, *FLEXIO_MemMapPtr;

/** Number of instances of the FLEXIO module. */
#define FLEXIO_INSTANCE_COUNT                    (2u)

/* FLEXIO - Peripheral instance base addresses */
/** Peripheral FLEXIO_0 base address */
#define IP_FLEXIO_0_BASE                         (0x402B0000u)
/** Peripheral FLEXIO_0 base pointer */
#define IP_FLEXIO_0                              ((FLEXIO_Type *)IP_FLEXIO_0_BASE)
/** Peripheral FLEXIO_1 base address */
#define IP_FLEXIO_1_BASE                         (0x406B8000u)
/** Peripheral FLEXIO_1 base pointer */
#define IP_FLEXIO_1                              ((FLEXIO_Type *)IP_FLEXIO_1_BASE)
/** Array initializer of FLEXIO peripheral base addresses */
#define IP_FLEXIO_BASE_ADDRS                     { IP_FLEXIO_0_BASE, IP_FLEXIO_1_BASE }
/** Array initializer of FLEXIO peripheral base pointers */
#define IP_FLEXIO_BASE_PTRS                      { IP_FLEXIO_0, IP_FLEXIO_1 }

/* ----------------------------------------------------------------------------
   -- FLEXIO Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXIO_Register_Masks FLEXIO Register Masks
 * @{
 */

